tutorials/CFD/17YJunction/0/Ulifty0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulifty0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0 -0.192074 0)
(0 -0.263939 0)
(0 -0.334105 0)
(0 -0.200672 0)
(0 -0.298397 0)
(0 -0.294575 0)
(0 -0.187812 0)
(0 -0.303208 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (0 -1 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0 -0.0287236 0)
(0 -0.0631241 0)
(0 -0.0685246 0)
(0 -0.0661142 0)
(0 -0.0611195 0)
(0 -0.055057 0)
(0 -0.0484917 0)
(0 -0.0417234 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
